###################################################################

# Created by write_sdc on Sun Feb 13 21:48:24 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[31]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[30]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[29]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[28]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[27]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[26]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[25]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[24]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[23]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[22]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[21]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[20]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[19]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[18]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[17]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[16]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[15]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[14]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[13]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[12]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[11]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[10]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[9]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[8]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[7]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[6]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[5]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[4]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[3]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[2]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[1]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_IM[0]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[31]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[30]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[29]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[28]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[27]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[26]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[25]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[24]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[23]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[22]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[21]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[20]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[19]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[18]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[17]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[16]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[15]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[14]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[13]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[12]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[11]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[10]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[9]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[8]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[7]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[6]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[5]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[4]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[3]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[2]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[1]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_ADD_DM[0]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[31]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[30]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[29]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[28]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[27]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[26]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[25]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[24]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[23]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[22]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[21]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[20]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[19]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[18]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[17]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[16]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[15]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[14]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[13]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[12]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[11]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[10]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[9]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[8]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[7]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[6]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[5]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[4]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[3]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[2]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[1]}]
set_load -pin_load 3.40189 [get_ports {RISCV_OUT_DM_DT[0]}]
set_load -pin_load 3.40189 [get_ports RISCV_OUT_DM_RD]
set_load -pin_load 3.40189 [get_ports RISCV_OUT_DM_WR]
create_clock [get_ports RISCV_IN_CLK]  -name MY_CLK  -period 20  -waveform {0 10}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RISCV_IN_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RISCV_IN_RST]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_INST[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_IN_DT[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_IM[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_ADD_DM[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RISCV_OUT_DM_DT[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports RISCV_OUT_DM_RD]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports RISCV_OUT_DM_WR]
