###################################################################

# Created by write_sdc on Mon Oct 18 17:09:35 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports FILTER_OUT_VOUT]
set_load -pin_load 3.40189 [get_ports {FILTER_OUT_DATA[12]}]
set_load -pin_load 3.40189 [get_ports {FILTER_OUT_DATA[11]}]
set_load -pin_load 3.40189 [get_ports {FILTER_OUT_DATA[10]}]
set_load -pin_load 3.40189 [get_ports {FILTER_OUT_DATA[9]}]
set_load -pin_load 3.40189 [get_ports {FILTER_OUT_DATA[8]}]
set_load -pin_load 3.40189 [get_ports {FILTER_OUT_DATA[7]}]
set_load -pin_load 3.40189 [get_ports {FILTER_OUT_DATA[6]}]
set_load -pin_load 3.40189 [get_ports {FILTER_OUT_DATA[5]}]
set_load -pin_load 3.40189 [get_ports {FILTER_OUT_DATA[4]}]
set_load -pin_load 3.40189 [get_ports {FILTER_OUT_DATA[3]}]
set_load -pin_load 3.40189 [get_ports {FILTER_OUT_DATA[2]}]
set_load -pin_load 3.40189 [get_ports {FILTER_OUT_DATA[1]}]
set_load -pin_load 3.40189 [get_ports {FILTER_OUT_DATA[0]}]
create_clock [get_ports FILTER_IN_CLK]  -name MY_CLK  -period 10  -waveform {0 5}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_DATA[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_DATA[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_DATA[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_DATA[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_DATA[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_DATA[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_DATA[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_DATA[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_DATA[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_DATA[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_DATA[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_DATA[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_DATA[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports FILTER_IN_VIN]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports FILTER_IN_RST_N]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[142]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[141]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[140]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[139]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[138]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[137]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[136]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[135]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[134]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[133]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[132]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[131]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[130]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[129]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[128]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[127]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[126]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[125]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[124]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[123]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[122]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[121]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[120]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[119]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[118]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[117]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[116]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[115]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[114]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[113]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[112]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[111]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[110]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[109]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[108]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[107]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[106]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[105]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[104]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[103]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[102]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[101]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[100]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[99]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[98]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[97]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[96]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[95]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[94]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[93]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[92]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[91]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[90]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[89]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[88]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[87]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[86]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[85]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[84]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[83]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[82]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[81]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[80]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[79]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[78]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[77]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[76]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[75]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[74]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[73]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[72]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[71]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[70]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[69]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[68]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[67]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[66]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[65]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[64]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[63]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[62]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[61]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[60]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[59]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[58]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[57]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[56]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[55]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[54]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[53]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[52]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[51]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[50]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[49]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[48]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[47]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[46]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[45]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[44]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[43]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[42]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[41]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[40]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[39]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[38]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[37]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[36]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[35]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[34]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[33]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[32]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_IN_A_COEFF[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports FILTER_OUT_VOUT]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_OUT_DATA[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_OUT_DATA[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_OUT_DATA[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_OUT_DATA[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_OUT_DATA[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_OUT_DATA[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_OUT_DATA[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_OUT_DATA[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_OUT_DATA[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_OUT_DATA[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_OUT_DATA[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_OUT_DATA[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {FILTER_OUT_DATA[0]}]
